# Encoding

## Feature Engineering

- So far we have performed feature analysis

    - Data frame quick checks

    - categorical column analysis

    - bar cjharts

    - pie charts

    - numerical columns analysis

    - histogram , boxplots, outliers

    - Bi-multi variate analysis

    - Correlation etc

- Now we need to learn **Feature Engineering**

    - We will create a new columns for better ML models

    - we will perform the **Encoding** , which is convert Categorical to Numerical data

    - wew will do data **transformations**

    - we will perform **Scaling : Standardization and Normalization**

    - we will perform the **Missing value analysis**

- Simply feature engineerring means our data will be modified

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
file_path=r'C:\Users\SHRI\Documents\DS\Data_files\Visadataset.csv'

visadf=pd.read_csv(file_path)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

- Feature Analysis

- Feature Engineering

- Feature Selection

- Model Development

- Model Evaluation

- Model tuning

- Model Deployment

In [4]:
cat=visadf.select_dtypes(include='object').columns
num=visadf.select_dtypes(exclude='object').columns

In [5]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [6]:
num

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

## Encoding

- Encoding means catogerical data to numerical data

- ML/DL or any models works based on maths

- So models cannot understanmd english charactors 

- So it is very important convert categorical label to numerical values

- For example Gender column has two lables

    - Male

    - Female

- Then Female represent as 0 , Male represent as 1 based on alphabatical order

In [7]:
visadf['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

- Certified should assign as 0

- Denied should assign as 1

In [8]:
## Mapping

d={'Cerified':0,'Denied':1}
d

{'Cerified': 0, 'Denied': 1}

In [9]:
visadf['case_status']=visadf['case_status'].map(d)

In [10]:
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1.0
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,NaN
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1.0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1.0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,NaN
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,NaN
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,NaN
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,NaN
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,NaN

In [40]:
## in you are getting NaN getting NaN you ran double tiume
## so do one by one  from  starting
## read the data
## select the columns
## create a mapper
## map to select column

In [11]:
visadf['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [ ]:
d={}
d['Asia']=0
d['Africa']=1
d['North America']=2

In [12]:
lables=visadf['continent'].unique()
n=len(lables)

for i in range(n):
    #print(lables[i],i)
    d[lables[i]]=i

d

{'Cerified': 0,
 'Denied': 1,
 'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [13]:
lables=visadf['continent'].unique()
n=len(lables)
d1={}
for i in range(n):
    #print(lables[i],i)
    d1.append([lables[i]]=i)

d1     ## check it first and run

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (3684114152.py, line 6)

In [14]:
## by alphabetically

lables=visadf['continent'].unique()
d={}
for i,j in enumerate(lables):
    d[j]=i

d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [15]:
## sorted it  
## as it is in table

lables=sorted(visadf['continent'].unique())
d={}
for i,j in enumerate(lables):
    d[j]=i

d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [16]:
lables=sorted(visadf['continent'].unique())
d={i:j  for i,j in enumerate(lables)}
d

{0: 'Africa',
 1: 'Asia',
 2: 'Europe',
 3: 'North America',
 4: 'Oceania',
 5: 'South America'}

In [17]:
lables=sorted(visadf['continent'].unique())
d={j:i  for i,j in enumerate(lables)}
visadf['continent']=visadf['continent'].map(d)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,1.0
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,NaN
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1.0
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1.0
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,NaN
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,NaN
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,NaN
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,NaN
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,NaN

In [18]:
for i in cat[1:]:
    lables=sorted(visadf[i].unique())
    d={j:i for i,j in enumerate(lables)}
    visadf[i]=visadf[i].map(d)

In [19]:
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,0
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,1
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,0
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,0
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,1
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,1
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,1
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,1
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,1

# Lable Encoder

- LableEncoder is a method will convert cat lables to numerical values

- It is under package : **sklearn (sickit-learn)**

    - The class Name = **preprocessing**

        - The method Name = **LableEncoder**

In [80]:
## from <package>.<Class> import <method> 

from sklearn.preprocessing import LabelEncoder

- step1 : we need to import the method 

- step2 : save the method

- step3 : apply fit transform

- **fit transform**

    - **fit** : means find the logic

        - in above example fit means create a **mapper** or **dict**

    - **Transform** : Apply the logic and change the data

        - Applt the **mapper on the data**

In [20]:
## read the data again

file_path=r'C:\Users\SHRI\Documents\DS\Data_files\Visadataset.csv'

visadf=pd.read_csv(file_path)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [21]:
cat=visadf.select_dtypes(include='object').columns

In [22]:
# import the method
from sklearn.preprocessing import LabelEncoder
# save the method
le=LabelEncoder()
# apply fit transform
visadf['case_status']=le.fit_transform(visadf['case_status'])
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [23]:
from sklearn.preprocessing import LabelEncoder

la=LabelEncoder()
visadf['continent']=la.fit_transform(visadf['continent'])
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [24]:
## read the data again

file_path=r'C:\Users\SHRI\Documents\DS\Data_files\Visadataset.csv'

visadf=pd.read_csv(file_path)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [87]:
cat=visadf.select_dtypes(include='object').columns

In [25]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
for i in cat[1:]:
    visadf[i]=le.fit_transform(visadf[i])

visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

    ## OneHotEncoder
    
    - First how many lables are there in a column
    
    - That many new columns will be created extra
    
    - For example case status has two examples
    
        - Certified
    
        - Denied
    
    - So It will create two new extra columns
    
        - case status Certified
    
        - case status Denied
    
    - At a time one column value beacome 1 then other column value become 0
    
    - This means a **OneHotEncoder**
    
    |case_status|case_status_Certified|case_status_Denied|
    |-|
    |Certified|
    |Denied|

|case_status|case_status_Certified|case_status_Denied|
|-|-|-|
|Certified||1||0|
|Denied||0||1|

In [26]:
pd.get_dummies(visadf['continent'])

           0      1      2      3      4      5
0      False   True  False  False  False  False
1      False   True  False  False  False  False
2      False   True  False  False  False  False
3      False   True  False  False  False  False
4       True  False  False  False  False  False
...      ...    ...    ...    ...    ...    ...
25475  False   True  False  False  False  False
25476  False   True  False  False  False  False
25477  False   True  False  False  False  False
25478  False   True  False  False  False  False
25479  False   True  False  False  False  False

[25480 rows x 6 columns]

In [27]:
pd.get_dummies(visadf['case_status'])

           0      1
0      False   True
1       True  False
2      False   True
3      False   True
4       True  False
...      ...    ...
25475   True  False
25476   True  False
25477   True  False
25478   True  False
25479   True  False

[25480 rows x 2 columns]

In [28]:
pd.get_dummies(visadf['case_status'],dtype=int)

       0  1
0      0  1
1      1  0
2      0  1
3      0  1
4      1  0
...   .. ..
25475  1  0
25476  1  0
25477  1  0
25478  1  0
25479  1  0

[25480 rows x 2 columns]

In [29]:
pd.get_dummies(visadf['continent'],dtype=int)

       0  1  2  3  4  5
0      0  1  0  0  0  0
1      0  1  0  0  0  0
2      0  1  0  0  0  0
3      0  1  0  0  0  0
4      1  0  0  0  0  0
...   .. .. .. .. .. ..
25475  0  1  0  0  0  0
25476  0  1  0  0  0  0
25477  0  1  0  0  0  0
25478  0  1  0  0  0  0
25479  0  1  0  0  0  0

[25480 rows x 6 columns]